In [1]:
### Imports
import pandas as pd
import numpy as np

In [2]:
base_path="../data/"

In [3]:
# Loading Orders_Users Dataset
# TODO : Remove ,nrows=100000 to run for full dataset
fields=["order_id","user_id"]
df_orders_users = pd.read_csv("../data/orders.csv",usecols=fields,nrows=100000)

In [4]:
# Loading Orders_Products Dataset
# TODO : Remove ,nrows=100000 to run for full dataset
fields=["order_id","product_id"]
df_orders_products = pd.read_csv("../data/order_products__prior.csv",usecols=fields,nrows=100000)

In [5]:
df_orders_users.head()

   order_id  user_id
0   2539329        1
1   2398795        1
2    473747        1
3   2254736        1
4    431534        1

In [6]:
df_orders_products.head()

   order_id  product_id
0         2       33120
1         2       28985
2         2        9327
3         2       45918
4         2       30035

In [7]:
# user,product Merge
fields=["user_id","product_id"]
df_users_products=df_orders_users.merge(df_orders_products,on='order_id')[fields]
df_users_products.head()

   user_id  product_id
0       23        3873
1       23       28199
2       23       42372
3       23       23106
4       23       33819

In [8]:
# converting into user,product,counts
df_user_product_count=df_users_products.groupby(fields).size().to_frame(name = 'count').reset_index()
df_user_product_count.head()

   user_id  product_id  count
0       23        3108      1
1       23        3873      1
2       23        3919      1
3       23        7883      1
4       23       23106      1

In [9]:
# Saving into pickle as user_product_counts
file_name=base_path+"user_product_count"
df_user_product_count.to_pickle(file_name)